wdsll/stm32f407_Eth_Fsmc/E_couple/RTD/include/Adc_Sar_Ip.h
/*==================================================================================================
*   Project              : RTD AUTOSAR 4.7
*   Platform             : CORTEXM
*   Peripheral           : ADC_SAR
*   Dependencies         : none
*
*   Autosar Version      : 4.7.0
*   Autosar Revision     : ASR_REL_4_7_REV_0000
*   Autosar Conf.Variant :
*   SW Version           : 4.0.0
*   Build Version        : S32K3_RTD_4_0_0_P19_D2403_ASR_REL_4_7_REV_0000_20240315
*
*   Copyright 2020 - 2024 NXP
*
*   NXP Confidential. This software is owned or controlled by NXP and may only be
*   used strictly in accordance with the applicable license terms. By expressly
*   accepting such terms or by downloading, installing, activating and/or otherwise
*   using the software, you are agreeing that you have read, and that you agree to
*   comply with and are bound by, such license terms. If you do not agree to be
*   bound by the applicable license terms, then you may not retain, install,
*   activate or otherwise use the software.
==================================================================================================*/

#ifndef ADC_SAR_IP_H
#define ADC_SAR_IP_H

/**
*   @file
*
*   @addtogroup adc_sar_ip Adc Sar IPL
*   @{
*/

#ifdef __cplusplus
extern "C"{
#endif

/*==================================================================================================
*                                        INCLUDE FILES
* 1) system and project includes
* 2) needed interfaces from external units
* 3) internal and external interfaces from this unit
==================================================================================================*/
#include "Adc_Sar_Ip_Types.h"
#include "Adc_Sar_Ip_Cfg.h"

/*==================================================================================================
*                              SOURCE FILE VERSION INFORMATION
==================================================================================================*/
#define ADC_SAR_IP_VENDOR_ID                      43
#define ADC_SAR_IP_AR_RELEASE_MAJOR_VERSION       4
#define ADC_SAR_IP_AR_RELEASE_MINOR_VERSION       7
#define ADC_SAR_IP_AR_RELEASE_REVISION_VERSION    0
#define ADC_SAR_IP_SW_MAJOR_VERSION               4
#define ADC_SAR_IP_SW_MINOR_VERSION               0
#define ADC_SAR_IP_SW_PATCH_VERSION               0

/*==================================================================================================
*                                     FILE VERSION CHECKS
==================================================================================================*/
/* Check if Adc_Sar_Ip.h file and Adc_Sar_Ip_Types.h file are of the same vendor */
#if (ADC_SAR_IP_VENDOR_ID != ADC_SAR_IP_VENDOR_ID_TYPES)
    #error "Adc_Sar_Ip.h and Adc_Sar_Ip_Types.h have different vendor ids"
#endif

/* Check if Adc_Sar_Ip.h file and Adc_Sar_Ip_Types.h file are of the same Autosar version */
#if ((ADC_SAR_IP_AR_RELEASE_MAJOR_VERSION != ADC_SAR_IP_AR_RELEASE_MAJOR_VERSION_TYPES) || \
     (ADC_SAR_IP_AR_RELEASE_MINOR_VERSION != ADC_SAR_IP_AR_RELEASE_MINOR_VERSION_TYPES) || \
     (ADC_SAR_IP_AR_RELEASE_REVISION_VERSION != ADC_SAR_IP_AR_RELEASE_REVISION_VERSION_TYPES) \
    )
    #error "AutoSar Version Numbers of Adc_Sar_Ip.h and Adc_Sar_Ip_Types.h are different"
#endif

/* Check if Adc_Sar_Ip.h file and Adc_Sar_Ip_Types.h file are of the same Software version */
#if ((ADC_SAR_IP_SW_MAJOR_VERSION != ADC_SAR_IP_SW_MAJOR_VERSION_TYPES) || \
     (ADC_SAR_IP_SW_MINOR_VERSION != ADC_SAR_IP_SW_MINOR_VERSION_TYPES) || \
     (ADC_SAR_IP_SW_PATCH_VERSION != ADC_SAR_IP_SW_PATCH_VERSION_TYPES) \
    )
  #error "Software Version Numbers of Adc_Sar_Ip.h and Adc_Sar_Ip_Types.h are different"
#endif

/* Check if Adc_Sar_Ip.h file and Adc_Sar_Ip_Cfg.h file are of the same vendor */
#if (ADC_SAR_IP_VENDOR_ID != ADC_SAR_IP_VENDOR_ID_CFG)
    #error "Adc_Sar_Ip.h and Adc_Sar_Ip_Cfg.h have different vendor ids"
#endif

/* Check if Adc_Sar_Ip.h file and Adc_Sar_Ip_Cfg.h file are of the same Autosar version */
#if ((ADC_SAR_IP_AR_RELEASE_MAJOR_VERSION != ADC_SAR_IP_AR_RELEASE_MAJOR_VERSION_CFG) || \
     (ADC_SAR_IP_AR_RELEASE_MINOR_VERSION != ADC_SAR_IP_AR_RELEASE_MINOR_VERSION_CFG) || \
     (ADC_SAR_IP_AR_RELEASE_REVISION_VERSION != ADC_SAR_IP_AR_RELEASE_REVISION_VERSION_CFG) \
    )
    #error "AutoSar Version Numbers of Adc_Sar_Ip.h and Adc_Sar_Ip_Cfg.h are different"
#endif

/* Check if Adc_Sar_Ip.h file and Adc_Sar_Ip_Cfg.h file are of the same Software version */
#if ((ADC_SAR_IP_SW_MAJOR_VERSION != ADC_SAR_IP_SW_MAJOR_VERSION_CFG) || \
     (ADC_SAR_IP_SW_MINOR_VERSION != ADC_SAR_IP_SW_MINOR_VERSION_CFG) || \
     (ADC_SAR_IP_SW_PATCH_VERSION != ADC_SAR_IP_SW_PATCH_VERSION_CFG) \
    )
  #error "Software Version Numbers of Adc_Sar_Ip.h and Adc_Sar_Ip_Cfg.h are different"
#endif

/*==================================================================================================
*                                     DEFINITIONS
==================================================================================================*/
/*!
 * @brief Macros for status and notification flags
 *
 * These flags map to internal hardware flags in different registers, but are
 * grouped together for convenience.
 *
 */
#define ADC_SAR_IP_NOTIF_FLAG_NORMAL_ENDCHAIN    ((uint32)1U << 0U)
#define ADC_SAR_IP_NOTIF_FLAG_NORMAL_EOC         ((uint32)1U << 1U)
#define ADC_SAR_IP_NOTIF_FLAG_INJECTED_ENDCHAIN  ((uint32)1U << 2U)
#define ADC_SAR_IP_NOTIF_FLAG_INJECTED_EOC       ((uint32)1U << 3U)
#define ADC_SAR_IP_NOTIF_FLAG_CTU_EOC            ((uint32)1U << 4U)
#define ADC_SAR_IP_STATUS_FLAG_NORMAL_ENDCHAIN   ADC_SAR_IP_NOTIF_FLAG_NORMAL_ENDCHAIN   // 正常链结束状态  
#define ADC_SAR_IP_STATUS_FLAG_NORMAL_EOC        ADC_SAR_IP_NOTIF_FLAG_NORMAL_EOC          // 正常转换结束状态    
#define ADC_SAR_IP_STATUS_FLAG_INJECTED_ENDCHAIN ADC_SAR_IP_NOTIF_FLAG_INJECTED_ENDCHAIN    // 注入链结束状态  
#define ADC_SAR_IP_STATUS_FLAG_INJECTED_EOC      ADC_SAR_IP_NOTIF_FLAG_INJECTED_EOC        // 注入转换结束状态  
#define ADC_SAR_IP_STATUS_FLAG_CTU_EOC           ADC_SAR_IP_NOTIF_FLAG_CTU_EOC             // CTU（控制触发单元）结束状态 
#define ADC_SAR_IP_STATUS_FLAG_CALIBRATED        ((uint32)1U << 5U)
#define ADC_SAR_IP_STATUS_FLAG_NORMAL_STARTED    ((uint32)1U << 6U)
#define ADC_SAR_IP_STATUS_FLAG_INJECTED_STARTED  ((uint32)1U << 7U)
#define ADC_SAR_IP_STATUS_FLAG_INJECTED_ABORTED  ((uint32)1U << 8U)
#define ADC_SAR_IP_STATUS_FLAG_CTU_STARTED       ((uint32)1U << 9U)
#define ADC_SAR_IP_STATUS_FLAG_AUTOCLOCKOFF      ((uint32)1U << 10U)

#define ADC_SAR_IP_STATUS_FLAG_ALL       (ADC_SAR_IP_STATUS_FLAG_NORMAL_EOC | \
                                          ADC_SAR_IP_STATUS_FLAG_NORMAL_ENDCHAIN | \
                                          ADC_SAR_IP_STATUS_FLAG_INJECTED_EOC | \
                                          ADC_SAR_IP_STATUS_FLAG_INJECTED_ENDCHAIN | \
                                          ADC_SAR_IP_STATUS_FLAG_CTU_EOC | \
                                          ADC_SAR_IP_STATUS_FLAG_CALIBRATED | \
                                          ADC_SAR_IP_STATUS_FLAG_NORMAL_STARTED | \
                                          ADC_SAR_IP_STATUS_FLAG_INJECTED_STARTED | \
                                          ADC_SAR_IP_STATUS_FLAG_INJECTED_ABORTED | \
                                          ADC_SAR_IP_STATUS_FLAG_CTU_STARTED | \
                                          ADC_SAR_IP_STATUS_FLAG_AUTOCLOCKOFF \
                                          )
#define ADC_SAR_IP_NOTIF_FLAG_ALL        (ADC_SAR_IP_NOTIF_FLAG_NORMAL_EOC | \
                                          ADC_SAR_IP_NOTIF_FLAG_NORMAL_ENDCHAIN | \
                                          ADC_SAR_IP_NOTIF_FLAG_INJECTED_EOC | \
                                          ADC_SAR_IP_NOTIF_FLAG_INJECTED_ENDCHAIN | \
                                          ADC_SAR_IP_NOTIF_FLAG_CTU_EOC \
                                          )


/*!
 * @brief Macros for channel notifications
 *
 * These notification flags map to internal hardware flags in different registers,
 * but are grouped together for convenience.
 *
 */
#define ADC_SAR_IP_CHAN_NOTIF_EOC      ((uint32)1U << 0U)   
#define ADC_SAR_IP_CHAN_NOTIF_WDG      ((uint32)1U << 1U)

#define ADC_SAR_IP_CHAN_NOTIF_FLAG_ALL (ADC_SAR_IP_CHAN_NOTIF_EOC | \
                                        ADC_SAR_IP_CHAN_NOTIF_WDG \
                                        )


/*!
 * @brief Macros for watchdog registers
 *
 * These macros help decode and compose bit mask for watchdog functionality
 *
 */
#define ADC_SAR_IP_WDG_HIGH_FLAG                  ((uint32)1UL << 1U)
#define ADC_SAR_IP_WDG_LOW_FLAG                   ((uint32)1UL << 0U)

/*==================================================================================================
                                     FUNCTION PROTOTYPES
==================================================================================================*/
#define ADC_START_SEC_CODE
#include "Adc_MemMap.h"

/*!
* @brief Return the address of the specified data register
*
* This function returns the address of the specified data register
*
* @param[in] u32Instance - ADC instance number
* @param[in] u32ChannelIndex - adc channel of the Hw unit
* @return status:
*  - value of the address of the data for the specified channel
*/
uint32 Adc_Sar_Ip_GetDataAddress(uint32 u32Instance,
                                 uint32 u32ChannelIndex);

/*!
 * @brief Initialize ADC_SAR module
 *
 * This function initializes the ADC_SAR module by configuring all
 * available features.
 *
 * @param[in] u32Instance - ADC instance number
 * @param[in] pConfig - configuration struct pointer
 * @return status:
 *  - ADC_SAR_IP_STATUS_SUCCESS: init successful
 *  - ADC_SAR_IP_STATUS_TIMEOUT: init step timed out
 */
Adc_Sar_Ip_StatusType Adc_Sar_Ip_Init(const uint32 u32Instance,
                                      const Adc_Sar_Ip_ConfigType * const pConfig);

/*!
 * @brief Deinitialize ADC_SAR module
 *
 * This function resets the ADC internal registers to default values.
 *
 * @param[in] u32Instance - ADC instance number
 * @return status:
 *  - ADC_SAR_IP_STATUS_SUCCESS: deinit successful
 *  - ADC_SAR_IP_STATUS_TIMEOUT: deinit step timed out
 */
Adc_Sar_Ip_StatusType Adc_Sar_Ip_Deinit(const uint32 u32Instance);

/*!
 * @brief Configures the converter chains the given configuration structure
 *
 * This function configures the ADC Normal and Injected Chains with the options
 * provided in the structure.
 *
 * @param[in] u32Instance - ADC instance number
 * @param[in] pChansIdxMask - channel configuration structure
 * @param[in] pChainType - conversion chain (Normal or Injected)
 * @return void
 */
void Adc_Sar_Ip_ChainConfig(const uint32 u32Instance,
                            const Adc_Sar_Ip_ChansIdxMaskType * const pChansIdxMask,
                            const Adc_Sar_Ip_ConvChainType pChainType);

/*!
 * @brief Enable a channel
 *
 * This function enables a channel in a specified conversion chain
 *
 * @param[in] u32Instance - ADC instance number
 * @param[in] pChainType - conversion chain (Normal or Injected)
 * @param[in] u32ChnIdx - channel index(channel number in the RM)
 * @return void
 */
void Adc_Sar_Ip_EnableChannel(const uint32 u32Instance,
                              const Adc_Sar_Ip_ConvChainType pChainType,
                              const uint32 u32ChnIdx);

/*!
 * @brief Disable a channel
 *
 * This function disables a channel in a specified conversion chain
 *
 * @param[in] u32Instance - ADC instance number
 * @param[in] pChainType - conversion chain (Normal or Injected)
 * @param[in] u32ChnIdx - channel index(channel number in the RM)
 * @return void
 */
void Adc_Sar_Ip_DisableChannel(const uint32 u32Instance,
                               const Adc_Sar_Ip_ConvChainType pChainType,
                               const uint32 u32ChnIdx);

#if (ADC_SAR_IP_SET_RESOLUTION == STD_ON)
/*!
 * @brief Set conversion resolution
 *
 * This function sets the conversion resolution (number of bits per conversion data)
 *
 * @param[in] u32Instance - ADC instance number
 * @param[in] eResolution - conversion resolution
 * @return void
 */
void Adc_Sar_Ip_SetResolution(const uint32 u32Instance,
                              const Adc_Sar_Ip_Resolution eResolution);
#endif /* (ADC_SAR_IP_SET_RESOLUTION == STD_ON) */

/*!
 * @brief Start conversion
 *
 * This function starts a conversion channel (Normal or Injected)
 *
 * @param[in] u32Instance - ADC instance number
 * @param[in] pChainType - conversion chain (Normal or Injected)
 * @return void
 */
void Adc_Sar_Ip_StartConversion(const uint32 u32Instance,
                                const Adc_Sar_Ip_ConvChainType pChainType);

/*!
 * @brief Get the status flags
 *
 * This function returns the status flags of the ADC.
 *
 * @param[in] u32Instance - ADC instance number
 * @return the status flag bit-mask
 */
uint32 Adc_Sar_Ip_GetStatusFlags(const uint32 u32Instance);

/*!
 * @brief Clear the status flags
 *
 * This function clears the status flags of the ADC.
 *
 * @param[in] u32Instance - ADC instance number
 * @param[in] u32Mask - bit-mask of flags to clear
 * @return void
 */
void Adc_Sar_Ip_ClearStatusFlags(const uint32 u32Instance,
                                 const uint32 u32Mask);

/*!
 * @brief Self test
 *
 * This function executes a self test on the ADC instance.
 *
 * @param[in] u32Instance - ADC instance number
 * @return status:
 *  - ADC_SAR_IP_STATUS_SUCCESS: self testing successful
 *  - ADC_SAR_IP_STATUS_TIMEOUT: self testing step timed out
 */
Adc_Sar_Ip_StatusType Adc_Sar_Ip_SelfTest(const uint32 u32Instance);

/*!
 * @brief Get conversion results for a conversion chain
 *
 * This function gets the conversion results for the selected Conversion Chain.
 *
 * @param[in] u32Instance - ADC instance number
 * @param[in] pChainType - conversion chain (Normal, Injected or CTU)
 * @param[in] u32Length - the length of the buffer
 * @param[out] pResults - the output buffer
 * @return the number of values written in the buffer (max length)
 */
uint32 Adc_Sar_Ip_GetConvDataToArray(const uint32 u32Instance,
                                     const Adc_Sar_Ip_ConvChainType pChainType,
                                     const uint32 u32Length,
                                     uint16 * const pResults);

/*!
 * @brief Get conversion results for a conversion chain with extended information
 *
 * This function gets the conversion results for the selected Conversion Chain, with
 * extended information about each conversion result (channel index, valid an overwritten
 * properties and conversion data). This function should be used in case of configurations
 * with overlapping channel lists in different chains, resulting in overwrite of conversion
 * data when a higher priority chain is executed before all data was read.
 *
 * @param[in] u32Instance - ADC instance number
 * @param[in] pChainType - conversion chain (Normal, Injected or CTU)
 * @param[in] u32Length - the length of the buffer
 * @param[out] pResults - the output buffer
 * @return the number of values written in the buffer (max length)
 */
uint32 Adc_Sar_Ip_GetConvResultsToArray(const uint32 u32Instance,
                                        const Adc_Sar_Ip_ConvChainType pChainType,
                                        const uint32 u32Length,
                                        Adc_Sar_Ip_ChanResultType * const pResults);

/*!
 * @brief Return the result of the conversion
 *
 * This function returns the result of the conversion for a single channel
 *
 * @param [in] u32Instance - ADC instance number
 * @param [in] u32ChnIdx - channel index(channel number in the RM)
 * @return conversion data
 */
uint16 Adc_Sar_Ip_GetConvData(const uint32 u32Instance,
                              const uint32 u32ChnIdx);

/*!
 * @brief Return the result and the status of the conversion
 *
 * This function returns the result and the status of the conversion
 * for a single channel
 *
 * @param [in] u32Instance - ADC instance number
 * @param [in] u32ChnIdx - channel index(channel number in the RM)
 * @param [in] pChainType - conversion chain (Normal, Injected or CTU)
 * @param [out] pResult - pointer to the buffer where the result will be written
 * @return void
 */
void Adc_Sar_Ip_GetConvResult(const uint32 u32Instance,
                              const uint32  u32ChnIdx,
                              const Adc_Sar_Ip_ConvChainType pChainType,
                              Adc_Sar_Ip_ChanResultType * const pResult);

/*!
 * @brief Perform Calibration of the ADC
 *
 * This function performs a calibration of the ADC. The maximum input clock
 * frequency for the ADC is 80 MHz, checked with assertions if DEV_ASSERT is
 * enabled. After calibration, the ADC is left in Powerup state (PWDN bit is clear).
 *
 * @param[in] u32Instance - ADC instance number
 * @return the calibration result
 *  - ADC_SAR_IP_STATUS_SUCCESS: calibration successful
 *  - ADC_SAR_IP_STATUS_TIMEOUT: calibration step timed out
 *  - ADC_SAR_IP_STATUS_ERROR: calibration failed
 */
Adc_Sar_Ip_StatusType Adc_Sar_Ip_DoCalibration(const uint32 u32Instance);

/*!
 * @brief Power up the ADC
 *
 * This function enables the ADC (disables the Power Down feature).
 *
 * @param[in] u32Instance - ADC instance number
 * @return status:
 *  - ADC_SAR_IP_STATUS_SUCCESS: power up successful
 *  - ADC_SAR_IP_STATUS_TIMEOUT: power up failed
 */
Adc_Sar_Ip_StatusType Adc_Sar_Ip_Powerup(const uint32 u32Instance);

/*!
 * @brief Power down the ADC
 *
 * This function disables the ADC (enables the Power Down feature).
 *
 * @param[in] u32Instance - ADC instance number
 * @return status:
 *  - ADC_SAR_IP_STATUS_SUCCESS: power down successful
 *  - ADC_SAR_IP_STATUS_TIMEOUT: power down failed
 */
Adc_Sar_Ip_StatusType Adc_Sar_Ip_Powerdown(const uint32 u32Instance);

#if ( \
     (STD_ON == ADC_SAR_IP_ECH_ENABLED) || (STD_ON == ADC_SAR_IP_JECH_ENABLED) || \
     (STD_ON == ADC_SAR_IP_EOC_ENABLED) || \
     ((ADC_SAR_IP_HAS_CTU == 1U) && (STD_ON == ADC_SAR_IP_EOCTU_ENABLED)) \
    )
/*!
 * @brief Enable ADC interrupts
 *
 * This function enables ADC interrupts.
 *
 * @param[in] u32Instance - ADC instance number
 * @param[in] u32NotificationMask - mask of interrupts to enable (of status flags)
 * @return void
 */
void Adc_Sar_Ip_EnableNotifications(const uint32 u32Instance,
                                    const uint32 u32NotificationMask);

/*!
 * @brief Disable ADC interrupts
 *
 * This function disables ADC interrupts.
 *
 * @param[in] u32Instance - ADC instance number
 * @param[in] u32NotificationMask - mask of interrupts to disable (of status flags)
 * @return void
 */
void Adc_Sar_Ip_DisableNotifications(const uint32 u32Instance,
                                     const uint32 u32NotificationMask);
#endif /* (STD_ON == ADC_SAR_IP_ECH_ENABLED) .. */

#if ((STD_ON == ADC_SAR_IP_WDG_ENABLED) || (STD_ON == ADC_SAR_IP_EOC_ENABLED))
/*!
 * @brief Enable ADC interrupt for a channel
 *
 * This function enables interrupt generation on End of Conversion and watchdog
 * events for a single channel.
 * The mask parameter can be set using the defines provided in the driver header
 * file that have the pattern ADC_SAR_IP_CHAN_NOTIF_... e.g. ADC_SAR_IP_CHAN_NOTIF_EOC.
 *
 * @param[in] u32Instance - ADC instance number
 * @param[in] u32ChnIdx - channel index(channel number in the RM)
 * @param[in] u32Mask - mask selecting targeted events
 * @return void
 */
void Adc_Sar_Ip_EnableChannelNotifications(const uint32 u32Instance,
                                           const uint32 u32ChnIdx,
                                           const uint32 u32Mask);

/*!
 * @brief Disable ADC interrupt for a channel
 *
 * This function disables interrupt generation on End of Conversion and watchdog
 * events for a single channel.
 * The mask parameter can be set using the defines provided in the driver header
 * file that have the pattern ADC_SAR_IP_CHAN_NOTIF_... e.g. ADC_SAR_IP_CHAN_NOTIF_EOC.
 *
 * @param[in] u32Instance - ADC instance number
 * @param[in] u32ChnIdx - channel index(channel number in the RM)
 * @param[in] u32Mask - mask selecting targeted events
 * @return void
 */
void Adc_Sar_Ip_DisableChannelNotifications(const uint32 u32Instance,
                                            const uint32 u32ChnIdx,
                                            const uint32 u32Mask);
#endif /* ((STD_ON == ADC_SAR_IP_WDG_ENABLED) || (STD_ON == ADC_SAR_IP_EOC_ENABLED)) */

/*!
 * @brief Set the ADC clocks
 *
 * This function initializes the ADC clock configuration.
 *
 * @param[in] u32Instance - ADC instance number
 * @param[in] pConfig - the clock configuration
 * @return status:
 *  - ADC_SAR_IP_STATUS_SUCCESS: set successful
 *  - ADC_SAR_IP_STATUS_TIMEOUT: power up or down sequence timed out
 */
Adc_Sar_Ip_StatusType Adc_Sar_Ip_SetClockMode(const uint32 u32Instance,
                                              const Adc_Sar_Ip_ClockConfigType * const pConfig);

#if FEATURE_ADC_HAS_CONVERSION_TIMING
/*!
 * @brief Set the sample times
 *
 * This function sets the sample times for each channnel group.
 * Note: aSampleTimes must contain the sample times in order of the channel
 * groups, e.g. sample time for the channel group 1 must be on the first position.
 *
 * @param[in] u32Instance - ADC instance number
 * @param[in] aSampleTimes - array with size ADC_SAR_IP_NUM_GROUP_CHAN containing sample times for each channel group
 * @return void
 */
void Adc_Sar_Ip_SetSampleTimes(const uint32 u32Instance,
                               const uint8 * const aSampleTimes);
#endif /* FEATURE_ADC_HAS_CONVERSION_TIMING */

#if FEATURE_ADC_HAS_AVERAGING
/*!
 * @brief Configure averaging
 *
 * This function enables averaging and selects the number of conversions to average.
 * The mask parameter should be set using the Adc_Sar_Ip_AvgSelectType enum elements
 * that have the pattern ADC_SAR_IP_AVG_... e.g. ADC_SAR_IP_AVG_4_CONV.
 *
 * @param[in] u32Instance - ADC instance number
 * @param[in] bAvgEn - enable or disable averaging
 * @param[in] eAvgSel - selects number of conversions to average
 * @return void
 */
void Adc_Sar_Ip_SetAveraging(const uint32 u32Instance,
                             const boolean bAvgEn,
                             const Adc_Sar_Ip_AvgSelectType eAvgSel);
#endif /* FEATURE_ADC_HAS_AVERAGING */

/*!
 * @brief Abort ongoing conversion
 *
 * This function aborts an ongoing conversion.
 *
 * @param[in] u32Instance - ADC instance number
 * @return void
 */
void Adc_Sar_Ip_AbortConversion(const uint32 u32Instance);

/*!
 * @brief Abort ongoing chain conversion
 *
 * This function aborts an ongoing chain of conversions.
 * If scan(continuos) mode is selected, then bAllowRestart selects whether
 * the abort command restarts the chain or stops it. For one shot conversion,
 * this should be FALSE.
 *
 * @param[in] u32Instance - ADC instance number
 * @param[in] bBlocking - wait and check that the ongoing conversion has stopped
 * @param[in] bAllowRestart - restart continuos conversion instead of aborting
 * @return status:
 *  - ADC_SAR_IP_STATUS_SUCCESS: abort successful
 *  - ADC_SAR_IP_STATUS_TIMEOUT: ongoing conversion could not be stopped
 * @return void
 */
Adc_Sar_Ip_StatusType Adc_Sar_Ip_AbortChain(const uint32 u32Instance,
                                            const boolean bBlocking,
                                            const boolean bAllowRestart);

