wdsll/stm32f407_Eth_Fsmc/E_couple/RTD/include/Adc_Sar_Ip.h
#if FEATURE_ADC_HAS_PRESAMPLING
/*!
 * @brief Set the Presampling Source for the channel group
 *
 * This function configures the Presampling Source for a channel group.
 *
 * @param[in] u32Instance - ADC instance number
 * @param[in] pChanGroup - the channel group
 * @param[in] pPresampleSource - the presampling source
 * @return void
 */
void Adc_Sar_Ip_SetPresamplingSource(const uint32 u32Instance,
                                     const Adc_Sar_Ip_ChanGroupType pChanGroup,
                                     const Adc_Sar_Ip_PresamplingSourceType pPresampleSource);

/*!
 * @brief Enable Presampling on one channel
 *
 * This function enables the Presampling on one channel of the ADC.
 *
 * @param[in] u32Instance - ADC instance number
 * @param[in] u32ChnIdx - channel index(channel number in the RM)
 * @return void
 */
void Adc_Sar_Ip_EnableChannelPresampling(const uint32 u32Instance,
                                         const uint32 u32ChnIdx);

/*!
 * @brief Disable Presampling on one channel
 *
 * This function disables the Presampling on one channel of the ADC.
 *
 * @param[in] u32Instance - ADC instance number
 * @param[in] u32ChnIdx - channel index(channel number in the RM)
 * @return void
 */
void Adc_Sar_Ip_DisableChannelPresampling(const uint32 u32Instance,
                                          const uint32 u32ChnIdx);

/*!
 * @brief Enable Conversion Presampled Data
 *
 * This function enables bypass of the Sampling Phase, resulting in a conversion
 * of the presampled data. This is available only for channels that have presampling
 * enabled.
 *
 * @param[in] u32Instance - ADC instance number
 * @return void
 */
void Adc_Sar_Ip_EnablePresampleConversion(const uint32 u32Instance);

/*!
 * @brief Disable Conversion of Presampled Data
 *
 * This function disables Sampling Phase bypass.
 *
 * @param[in] u32Instance - ADC instance number
 * @return void
 */
void Adc_Sar_Ip_DisablePresampleConversion(const uint32 u32Instance);
#endif /* FEATURE_ADC_HAS_PRESAMPLING */

/*!
 * @brief Enable DMA Requests
 *
 * This function enables requests to DMA from ADC
 *
 * @param[in] u32Instance - ADC instance number
 * @return void
 */
void Adc_Sar_Ip_EnableDma(const uint32 u32Instance);

/*!
 * @brief Disable DMA Requests
 *
 * This function disables requests to DMA from ADC
 *
 * @param[in] u32Instance - ADC instance number
 * @return void
 */
void Adc_Sar_Ip_DisableDma(const uint32 u32Instance);

/*!
 * @brief Enable DMA on one channel
 *
 * This function enables DMA requests triggered by End of Conversion event from
 * a selected channel.
 *
 * @param[in] u32Instance - ADC instance number
 * @param[in] u32ChnIdx - channel index(channel number in the RM)
 * @return void
 */
void Adc_Sar_Ip_EnableChannelDma(const uint32 u32Instance,
                                 const uint32 u32ChnIdx);

/*!
 * @brief Disable DMA on one channel
 *
 * This function disables DMA requests triggered by End of Conversion event from
 * a selected channel.
 *
 * @param[in] u32Instance - ADC instance number
 * @param[in] u32ChnIdx - channel index(channel number in the RM)
 * @return void
 */
void Adc_Sar_Ip_DisableChannelDma(const uint32 u32Instance,
                                  const uint32 u32ChnIdx);

/*!
 * @brief Disable DMA on all channels
 *
 * This function disables DMA requests triggered by End of Conversion event from
 * all channels.
 *
 * @param[in] u32Instance - ADC instance number
 * @return void
 */
void Adc_Sar_Ip_DisableChannelDmaAll(const uint32 u32Instance);

/*!
 * @brief Set DMA Request Clear Source
 *
 * This function selects the DMA Request Flag Clear Source.
 *
 * @param[in] u32Instance - ADC instance number
 * @param[in] pDmaClear - the clear source for DMA Requests (Ack from DMA Controller or
    read of data registers)
 * @return void
 */
void Adc_Sar_Ip_SetDmaClearSource(const uint32 u32Instance,
                                  const Adc_Sar_Ip_ClearSourceType pDmaClear);

#if (STD_ON == ADC_SAR_IP_WDG_ENABLED)
/*!
 * @brief Configure watchdog threshold register
 *
 * This function configures the high/low thresholds for a certain register.
 *
 * @param [in] u32Instance - ADC instance number
 * @param [in] u8RegisterIdx - the index of the register
 * @param [in] pThresholdValues - the threshold values
 * @return void
 */
void Adc_Sar_Ip_SetWdgThreshold(const uint32 u32Instance,
                                const uint8 u8RegisterIdx,
                                const Adc_Sar_Ip_WdgThresholdType * const pThresholdValues);
#endif /* (STD_ON == ADC_SAR_IP_WDG_ENABLED) */

/*!
 * @brief Configure conversion mode
 *
 * This function configures the used conversion mode.
 * Note: The selected ADC instance must be in the IDLE state.
 *
 * @param [in] u32Instance - ADC instance number
 * @param [in] eConvMode - selected conversion mode
 * @return void
 */
void Adc_Sar_Ip_SetConversionMode(const uint32 u32Instance,
                                  const Adc_Sar_Ip_ConvModeType eConvMode);

#if ADC_SAR_IP_HAS_CTU
/*!
 * @brief Configure CTU mode
 *
 * This function configures the CTU mode and enable.
 *
 * @param [in] u32Instance - ADC instance number
 * @param [in] eCtuMode - selected CTU mode
 * @return status:
 *  - ADC_SAR_IP_STATUS_SUCCESS: set successful
 *  - ADC_SAR_IP_STATUS_TIMEOUT: power up or down sequence timed out
 */
Adc_Sar_Ip_StatusType Adc_Sar_Ip_SetCtuMode(const uint32 u32Instance,
                                            const Adc_Sar_Ip_CtuModeType eCtuMode);
#endif /* ADC_SAR_IP_HAS_CTU */

#if (ADC_SAR_IP_EXTERNAL_TRIGGER_ENABLE)
#if (FEATURE_ADC_HAS_INJ_EXT_TRIGGER || FEATURE_ADC_HAS_EXT_TRIGGER)
/*!
 * @brief Configure external trigger
 *
 * This function configures the external trigger.
 *
 * @param [in] u32Instance - ADC instance number
 * @param [in] eTriggerEdge - selected external trigger type
 * @param [in] eTrggerSrc - selects normal, auxiliary normal or injected trigger
 * @return void
 */
void Adc_Sar_Ip_SetExternalTrigger(const uint32 u32Instance,
                                   const Adc_Sar_Ip_ExtTriggerEdgeType eTriggerEdge,
                                   const Adc_Sar_Ip_ExtTriggerSourceType eTrggerSrc);
#endif /* (FEATURE_ADC_HAS_INJ_EXT_TRIGGER || FEATURE_ADC_HAS_EXT_TRIGGER) */
#endif /* (ADC_SAR_IP_EXTERNAL_TRIGGER_ENABLE) */

/*!
 * @brief Configure user gain and offset
 *
 * This function applies user gain and offset.
 *
 * @param [in] Instance - ADC instance number
 * @param [in] Gain - Gain value
 * @param [in] Offset - Offset value
 * @return void
 */
void Adc_Sar_Ip_SetUserGainAndOffset(const uint32 Instance,
                                     const uint16 Gain,
                                     const uint8 Offset);

