wdsll/stm32f407_Eth_Fsmc/E_couple/RTD/include/Adc_Sar_Ip.h
#if ADC_SAR_IP_HAS_TEMPSENSE_CHN
#if (ADC_SAR_IP_TEMPSENSE_ENABLED == STD_ON)
/*!
 * @brief Calculates the temperature on chip from the provided parameter.
 *
 * This function calculate the temperature on chip from the provided parameter
 * Note: u16AdcVref and u16TempSenseVsupply parameters must be in fixed point format
 * (1 bit for the sign, 11 bits for the integer part and 4 bits for the decimal part)
 *
 * @param [in] u32AdcInstance - Adc instance number
 * @param [in] u32TempInstance - TempSense instance number
 * @param [in] u16TempSenseAdcConvData - data measured on the ADC internal channel
 *             corresponding to TempSense, with 12 bit resolution
 * @return uint16: The temperature on chip in degrees C, expressed in fixed point format
 */
uint16 Adc_Sar_Ip_TempSenseCalculateTemp(const uint32 u32AdcInstance,
                                         const uint32 u32TempInstance,
                                         const uint16 u16TempSenseAdcConvData);

/*!
 * @brief Get the temperature on chip directly.
 *
 * This function starts a normal software conversion on tempsense channel with One-shot mode
 * and calculates the temperature on chip from the data conversion. At the end, tempsense
 * channel will be disabled. The previous initialized configuration may be affected by
 * calling this function
 * Note: u16AdcVref and u16TempSenseVsupply parameters must be in fixed point format
 * (1 bit for the sign, 11 bits for the integer part and 4 bits for the decimal part).
 * The function is synchronous: waits until the ADC conversion completes or timeout occurs
 *
 * @param [in] u32AdcInstance - Adc instance number
 * @param [in] u32TempInstance - TempSense instance number
 * @param [out] pTempSenseVal - The temperature on chip in degrees C, expressed in fixed point format
 * @return status:
 *  - ADC_SAR_IP_STATUS_SUCCESS: Get temperature successfully
 *  - ADC_SAR_IP_STATUS_TIMEOUT: Adc conversion did not complete
 */
Adc_Sar_Ip_StatusType Adc_Sar_Ip_TempSenseGetTemp(const uint32 u32AdcInstance,
                                                  const uint32 u32TempInstance,
                                                  uint16 * const pTempSenseVal);

/*!
 * @brief Enables the temperature sensor
 *
 * This function enables the temperature sensor.
 *
 * @param [in] u32Instance - TempSense instance number
 * @return void
 */
void Adc_Sar_Ip_TempSenseEnable(const uint32 u32Instance);

/*!
 * @brief Disables the temperature sensor
 *
 * This function disables the temperature sensor.
 *
 * @param [in] u32Instance - TempSense instance number
 * @return void
 */
void Adc_Sar_Ip_TempSenseDisable(const uint32 u32Instance);
#endif /* (ADC_SAR_IP_TEMPSENSE_ENABLED == STD_ON) */
#endif /* ADC_SAR_IP_HAS_TEMPSENSE_CHN */

#define ADC_STOP_SEC_CODE
#include "Adc_MemMap.h"

#ifdef __cplusplus
}
#endif

/** @} */

#endif /* ADC_SAR_IP_H */
